# source of probabilities:
# https://wiki.biligame.com/blhx/%E5%BB%BA%E9%80%A0%E6%A8%A1%E6%8B%9F%E5%99%A8

SHIP_LIST = {
  'light': {
    'super_rare': ['圣地亚哥', '蒙彼利埃', '贝尔法斯特', '天狼星', '确捷', '雪风', '明石', 'Z46', '阿芙乐尔'],
    'elite': ['莫里', '拉菲', '圣路易斯', '海伦娜', '小海伦娜', '克利夫兰', '丹佛', '小克利夫兰', '标枪', '吸血鬼', '无敌', '欧若拉', '谢菲尔德', '爱丁堡', '小贝法', '黑太子', '追赶者', '吹雪', '绫波', '野分', '夕张', '最上', '三隈', 'Z23', 'Z25', 'Z35', '长春', '太原', '逸仙', '宁海', '平海', '鲁莽'],
    'rare': ['哈曼', '本森', '贝利', '弗莱彻', '贝奇', '斯坦利', '撒切尔', '布什', '斯莫利', '霍比', '科尔克', '康克德', '孟菲斯', '布鲁克林', '菲尼克斯', '亚特兰大', '朱诺', '女将', '阿卡司塔', '热心', '命运女神', '丘比特', '泽西', '库拉索', '杓鹬', '阿基里斯', '阿贾克斯', '南安普顿', '格拉斯哥', '牙买加', '神风', '松风', '长月', '初春', '若叶', '初霜', '有明', '夕暮', '大潮', '浦风', '矶风', '谷风', 'Z18', 'Z19', '清波', '莱比锡'],
    'normal': ['卡辛', '唐斯', '克雷文', '麦考尔', '富特', '斯彭斯', '奥利克', '奥马哈', '罗利', '小猎兔犬', '大斗犬', '彗星', '新月', '小天鹅', '狐提', '利安得', '睦月', '如月', '卯月', '长良', '柯尼斯堡', '卡尔斯鲁厄', '科隆']
  },
  'heavy': {
    'super_rare': ['明尼阿波利斯', '北卡罗来纳', '华盛顿', '贝尔法斯特', '胡德', '厌战', '威尔士亲王', '约克公爵', '高雄', '爱宕', '欧根亲王', '提尔比茨'],
    'elite': ['休斯敦', '印第安纳波利斯', '威奇塔', '亚利桑那', '科罗拉多', '马里兰', '爱丁堡', '伦敦', '多塞特郡', '约克', '埃克塞特', '声望', '伊丽莎白女王', '纳尔逊', '罗德尼', '黑暗界', '恐怖', '阿贝克隆比', '雾岛', '德意志', '斯佩伯爵海军上将', '希佩尔海军上将', '小比叡'],
    'rare': ['北安普敦', '芝加哥', '波特兰', '宾夕法尼亚', '田纳西', '加利福尼亚', '什罗普郡', '苏塞克斯', '肯特', '萨福克', '诺福克', '反击', '伊势', '日向'],
    'normal': ['彭萨科拉', '内华达', '俄克拉荷马', '青叶', '衣笠']
  },
  'aircraft': {
    'super_rare': ['企业', '埃塞克斯', '贝尔法斯特', '半人马', '光辉', '胜利', '高雄', '爱宕', '翔鹤', '瑞鹤', '大凤', '伊19', '明石', '欧根亲王', 'U-81', '齐柏林伯爵', 'U-47'],
    'elite': ['休斯敦', '印第安纳波利斯', '威奇塔', '列克星敦', '萨拉托加', '约克城', '大黄蜂', '鲦鱼', '女灶神', '爱丁堡', '伦敦', '多塞特郡', '独角兽', '追赶者', '皇家方舟', '光荣', '伊26', '伊58', 'U-557', '小赤城', '小齐柏林'],
    'rare': ['北安普敦', '芝加哥', '波特兰', '长岛', '什罗普郡', '肯特', '萨福克', '诺福克'],
    'normal': ['彭萨科拉', '博格', '兰利', '突击者', '竞技神']
  }
}

# below are CUMULATIVE probabilities out of 100
# order: super_rare, elite, rare, normal
SHIP_CUML_PROB = {
    'light': [7, 19, 45, 100],
    'heavy': [7, 19, 70, 100],
    'aircraft': [7, 19, 70, 100]
}
