# source of probabilities:
# http://wiki.joyme.com/blhx/%E5%BB%BA%E9%80%A0%E6%A8%A1%E6%8B%9F%E5%99%A8?useskin=mediawikibootstrap2

LIGHTSHIP_LIST = {
	'super_rare': ['圣地亚哥', '贝尔法斯特', '明石', '蒙彼利埃'],
	'elite': ['莫里', '查尔斯·奥斯本', '拉菲', '海伦娜', '克利夫兰', '萤火虫', '标枪', '吸血鬼', '爱丁堡', '欧若拉', '吹雪', '绫波', '野分', '夕张', 'Z1', 'Z23', '逸仙', '宁海', '平海', '圣路易斯', '丹佛', '小贝法'],
	'rare': ['格里德利', '弗莱彻', '撒切尔', '本森', '西姆斯', '哈曼', '布鲁克林', '菲尼克斯', '亚特兰大', '朱诺', '女将', '阿卡司塔', '热心', '命运女神', '天后', '阿基里斯', '阿贾克斯', '阿瑞托莎', '加拉蒂亚', '初春', '初霜', '有明', '夕暮', '莱比锡', '贝利', '神风', '松风', '泽西', '浦风', '矶风', '谷风', '大潮', '布什', '孟菲斯', '康克德'],
	'normal': ['卡辛', '唐斯', '克雷文', '麦考尔', '奥利克', '富特', '斯彭斯', '奥马哈', '罗利', '小猎兔犬', '大斗犬', '彗星', '新月', '小天鹅', '狐提', '利安得', '长良', '柯尼斯堡', '卡尔斯鲁厄', '科隆', '睦月', '如月', '卯月']
	}
	
HEAVYSHIP_LIST = {
	'super_rare': ['贝尔法斯特', '胡德', '厌战', '威尔士亲王', '高雄', '爱宕', '欧根亲王'],
	'elite': ['休斯敦', '印第安纳波利斯', '威奇塔', '亚利桑那', '爱丁堡', '伦敦', '多塞特郡', '约克', '埃克塞特', '声望', '伊丽莎白女王', '纳尔逊', '罗德尼', '黑暗界', '恐怖', '德意志', '斯佩伯爵海军上将', '阿贝克隆比'],
	'rare': ['北安普敦', '芝加哥', '波特兰', '宾夕法尼亚', '田纳西', '加利福尼亚', '什罗普郡', '肯特', '萨福克', '诺福克', '反击', '伊势', '日向', '苏塞克斯'],
	'normal': ['彭萨科拉', '内华达', '俄克拉荷马', '青叶', '衣笠']
	}

AIRCRAFT_LIST = {
	'super_rare': ['企业', '贝尔法斯特', '光辉', '高雄', '爱宕', '翔鹤', '瑞鹤', '明石', '欧根亲王', '伊19', 'U-81', '半人马'],
	'elite': ['休斯敦', '印第安纳波利斯', '威奇塔', '列克星敦', '萨拉托加', '约克城', '大黄蜂', '女灶神', '爱丁堡', '伦敦', '多塞特郡', '独角兽', '皇家方舟', '光荣', '伊26', '伊58', '鲦鱼'],
	'rare': ['北安普敦', '芝加哥', '波特兰', '长岛', '什罗普郡', '肯特', '萨福克', '诺福克'],
	'normal': ['彭萨科拉', '博格', '兰利', '突击者', '竞技神']
	}

# below are CUMULATIVE probabilities out of 100
LIGHTSHIP_SUPERRARE_CUML_PROB = 7
LIGHTSHIP_ELITE_CUML_PROB = 19
LIGHTSHIP_RARE_CUML_PROB = 45
LIGHTSHIP_NORMAL_CUML_PROB = 100

HEAVYSHIP_SUPERRARE_CUML_PROB = 7
HEAVYSHIP_ELITE_CUML_PROB = 19
HEAVYSHIP_RARE_CUML_PROB = 70
HEAVYSHIP_NORMAL_CUML_PROB = 100

AIRCRAFT_SUPERRARE_CUML_PROB = 7
AIRCRAFT_ELITE_CUML_PROB = 19
AIRCRAFT_RARE_CUML_PROB = 70
AIRCRAFT_NORMAL_CUML_PROB = 100